Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Winterfest Update! New Year, New Hero A new warrior joins the ranks of the Guardians! Her name is Oya, and she's strong enough to smash any shield! Magical Tree We're having a Winterfest Tree contest! Help your guild grow the highest evergreen beauty in the Dominion to win unique prizes! The Archdemon Comes Bearing Gifts Heroes aren't the only ones who celebrate winter holidays! The Archdemon has prepared lots of gifts, but you'll have to fight for them! Welcome to the snowy Dominion!
pt_pt: Atualização do Festival de Inverno! Novo ano, novo Herói Oya, uma nova guerreira junta-se aos Guardiões! Ela é suficientemente forte para esmagar qualquer escudo! Árvore Mágica Está a decorrer um concurso da Árvore do Festival de Inverno! Ajuda a tua guilda a plantar a melhor árvore do Domínio e ganha prémios únicos! O Grão-Demónio traz prendas Não são só os Heróis que celebram a época festiva! O Grão-Demônio tem montes de prendas, mas vais ter de lutar por elas! Bem-vindo ao Domínio nevado!

source: There is already an account associated with this e-mail
pt_pt: Já existe uma conta associada a este e-mail

source: Grow the most powerful tree with your guild during the new three-day event!
pt_pt: Cultiva a árvore mais poderosa com a tua guilda durante o evento de três dias!

source: Good luck, Brave Hero!
pt_pt: Boa sorte, Herói!

source: Luckypaws, the Mayor of Leprechaun Town, seeks your aid!
pt_pt: Luckypaws, o presidente da Cidade Gnomo, precisa de ajuda!

source: Help him free the Leprecats and earn a generous reward!
pt_pt: Ajuda-o a libertar os Gnomolinos e ganha uma bela recompensa!

source: The life of Tempus is a story of power over the past and the future, of the eternal struggle against boredom, and of the search for self... The new event has paradoxical adventures and astonishing revelations in store for you, as well as a helping hand from the Lord of Time, capable of weakening enemies, slowing them down, or even taking them out completely! Break through a tide of enemies, defeat terrifying bosses, and learn how Tempus joined the Guardians of Dominion. Race against the clock!
pt_pt: A vida de Tempus é uma história de poder sobre o passado e o futuro, da eterna luta contra o aborrecimento e da busca por si mesmo ... O novo evento inclui aventuras paradoxais e incríveis revelações. Terás também a ajuda do Senhor do tempo, que é capaz de enfraquecer inimigos, abrandá-los e até de os eliminar! Abre caminho por uma vaga de inimigos, derrota bosses aterrorizantes e descobre como Tempus se juntou aos Guardiões do Domínio!. Corre contra o relógio!

source: UPGRADE YOUR LEGEND!
pt_pt: MELHORA A TUA LENDA!

source: We will send you a letter with your e-mail confirmation link
pt_pt: Vamos enviar-te uma carta com o teu link de confirmação de e-mail

source: Earn every trophy in September’s Battle Pass!
pt_pt: Ganha todos os troféus do Passe de Batalha de setembro!

source: This Month's Hero is Kai!
pt_pt: Kai é o Herói deste mês!

source: BABE...
pt_pt: QUERIDA...

source: I NEVER LIKED KIDS
pt_pt: NUNCA GOSTEI DE CRIANÇAS

source: The new update is here! • Valentine's Day: new Romantic Skins (Celeste, Jet, Orion) and an event sale. • Commands: Guildmasters and Generals can now select targets for attack during the Guild War. Changes: • Rarity Fair: starting at VIP level 9, the merchant lets you choose the hero. • Titan screen: revamped appearance. Bug fixes and much more! Good luck, Brave Hero, and remember - we are always here for you: support@herowars.zendesk.com.
pt_pt: Chegou a nova atualização! • Dia dos Namorados: novos visuais românticos (Celeste, Jet, Orion) e uma promoção de evento. • Comandos: os Mestres da Guilda e Generais passam a poder selecionar alvos durante a Guerra de Guildas. Alterações: • Feira das Raridades: desde o nível VIP 9, o comerciante deixa-te escolher o herói. • Ecrã de Titã: renovámos o aspeto. Corrigimos erros e muito mais! Boa sorte, Bravo Herói, e lembra-te! Estamos sempre aqui para ajudar-te, em: support@herowars.zendesk.com.

source: before playing.
pt_pt: antes de jogar.

source: Equip six Heroes with new Talismans!
pt_pt: Equipa seis Heróis com novos Talismãs!

source: ● 50+ Heroes with unique skills
pt_pt: ● Mais de 50 heróis com habilidades únicas

source: The following devices are NOT supported: iPhone 5S, 6, 6 Plus; iPad Air, Mini 2, Mini 3, iPod Touch.
pt_pt: Os dispositivos seguintes NÃO são suportados: iPhone 5S, 6, 6 Plus; iPad Air, Mini 2, Mini 3, iPod Touch.

source: Greetings!
pt_pt: Saudações!

source: In this quest, you have to place the tiles so that they match the design on the gate.
pt_pt: Nesta missão, tens de colocar os mosaicos de forma a corresponderem ao desenho do portão.

source: You've already moved the tile with the green parrot to the right place (that's why it turned white) Try to find the spots for the other two tiles
pt_pt: Já moveste o mosaico com o papagaio verde para o lugar certo (por isso é que se tornou branco) Tenta encontrar os lugares para os outros dois mosaicos

source: The Sun is shining over Dominion! Spring Festival The festivities are about to start! Get ready for great resources, spring avatars and frames, as well as Solaris artifacts and Soul Stones. So Classy We've updated the class Runes UI! Viewing and upgrading Runes one by one is now an easier experience, and the screen now displays the new max Glyph level. Switching It Up We've changed the order of rewards—now you get 50 Rune Spheres for guild activity level 3, not 4! Show 'em how it's done!
pt_pt: O sol ilumina o Domínio! Festival de Primavera A festa vai começar! Prepara-te para obter recursos, avatares e molduras primaveris, artefactos Solaris e Pedras Anímicas. Só Estilo Atualizámos a interface das runas de cada classe! Ver e melhorar cada runa é agora mais simples. Além disso, agora podes ver no ecrã o nível máximo de cada Glifo. Hora das Mudanças Alterámos a ordem em que recebes recompensas. Agora ganhas 50 Esferas de Runas no nível 3 da guilda! Vamos lá!

source: Take part in our Brawls and get lots of useful rewards to strengthen your Eternity Faction heroes!
pt_pt: Participa nas Brigas e obtém recompensas espetaculares para fortalecer os teus heróis da Fação Eternidade!

source: Summon the new Titan and unleash his power!
pt_pt: Invoca o novo Titã e liberta o seu poder!

source: SAVE YOURSELF
pt_pt: SALVA-TE

source: Otherworldly powers are trying to breach the Dominion!
pt_pt: O Domínio vai ser invadido por outro mundo!

source: New Chaotic hero Xe'Sha, a guest from another realm, is here.
pt_pt: Nova heroína Caótica Xe'Sha está de visita ao nosso mundo.

source: Behold her power for yourself!
pt_pt: Testemunha o seu poder!

source: And let's not forget Cleaver, who became even stronger when Xe'Sha arrived, eager to cut up his enemies!
pt_pt: Atenção ao Cleaver, que ficou ainda mais forte com a chegada de Xe'Sha e quer cortar inimigos às postas!

source: Halloween The Gates of Chaos are open, and the Dominion must be defended from unearthly monsters.
pt_pt: Dia das Bruxas Os Portões do Caos estão abertos e tens de defender o Domínio dos monstros sobrenaturais.

source: Assemble a party of Chaotic heroes, battle the dark cult, and celebrate victory with your friends as the spooky night arrives.
pt_pt: Forma um grupo de heróis Caóticos, enfrenta o culto sombrio e canta vitória junto dos teus amigos durante a noite assustadora.

source: May Chaos reign!
pt_pt: Que o Caos prevaleça!

source: You can unsubscribe from future mailings in your profile settings at any point in time.
pt_pt: Podes anular a subscrição de futuros e-mails nas definições do teu perfil a qualquer momento.

source: It’s time for the Way of Mystery heroes to shine!
pt_pt: Os heróis do Caminho do Mistério vão brilhar!

source: Upgrade your favorite heroes with new Beach Skins!
pt_pt: Melhora os teus heróis com novos Visuais de Praia!

source: on the pop-up window in the top left corner.
pt_pt: janela pop-up no canto superior esquerdo.

source: Embark on a search for Dominion’s mysteries with the legendary Lara Croft!
pt_pt: Procura os mistérios do Domínio com a lendária Lara Croft!

source: Free Gold and Runes!
pt_pt: Ouro e Runas grátis!

source: Click the image to get Gold and Great Enchantment Runes!
pt_pt: Clica na imagem para obter Ouro e Runas de Encantamento Excelentes!

source: The Darkness is on the rise!
pt_pt: A Escuridão alastra!

source: New Titan Keros the Twilight Eater is ready to step onto the battlefield and plunge it into the dark!
pt_pt: Novo Titã Keros, o Devorador do Crepúsculo, está pronto a entrar no campo de batalha e mergulhar tudo na escuridão!

source: The Dark Titan is a powerful fighter, capable of standing against any other Element.
pt_pt: O Titã da Escuridão é um lutador poderoso, capaz de enfrentar qualquer Elemento.

source: Take part in the special event to recruit him!
pt_pt: Participa no evento especial e recruta-o!

source: Solar Skins Lars, Krista, and Daredevil are radiant in their new outfits!
pt_pt: Visuais Solares Lars, Krista e Daredevil têm novos visuais resplandecentes!

source: And Lars's skin can also be upgraded and provide him with higher stats.
pt_pt: O visual de Lars pode ainda ser melhorado, o que melhora as suas estatísticas.

source: Rise and shine on the battlefield!
pt_pt: Brilha em combate!

source: Manage Subscriptions
pt_pt: Gerir subscrições

source: - Daredevil, Sebastian, Astrid, and Lucas get new Romantic Skins!
pt_pt: - Daredevil, Sebastian, Astrid e Lucas têm novos visuais românticos!

source: Come and get them!
pt_pt: Anda buscá-los!

source: An update for good vibes!
pt_pt: Uma atualização para chamar as boas vibrações!

source: Autumn Festival Heroes welcome the autumn in the Dominion once again!
pt_pt: Festival de Outono Os heróis dão novamente as boas-vindas ao Domínio!

source: A drink and a warm conversation will surely invigorate you before new tasks with a variety of trophies!
pt_pt: Uma bebida e uma boa conversa vão revigorar-te antes das novas tarefas e troféus!

source: Keeping Healthy A new way to display your Heroes' and their enemies' health bars is now available in the settings.
pt_pt: Vida Saudável Já está disponível nas definições uma nova forma de mostrar as barras de vida dos teus Heróis e dos seus inimigos.

source: Get ready to harvest rewards!
pt_pt: Prepara-te para recolher recompensas!

source: Thanks a lot for your feedback, so nice to see you enjoy Hero Wars!
pt_pt: Muito obrigado pela tua avaliação. Alegra-nos que estejas a desfrutar do Hero Wars!

source: LVL 1
pt_pt: NV. 1

source: Don't miss the biggest update of the season!
pt_pt: Espreita as novidades da temporada!

source: Coming soon:
pt_pt: Brevemente:

source: Summon a new shining beacon Titan and access some unique offers this spring!
pt_pt: Invoca nesta primavera um novo Titã brilhante e ganha acesso a ofertas únicas!

source: Learn more about the Dominion with Cascade!
pt_pt: Descobre mais sobre o Domínio com o Dilúvio!

source: To complete this quest, press the buttons to rotate the statues until their poses match the fresco on the wall.
pt_pt: Para completares esta missão, prime os botões para rodar as estátuas até que as suas poses correspondam ao fresco na parede.

source: Then repeat that for each of the three walls.
pt_pt: Depois, repete o processo para cada uma das três paredes.

source: Once you do that, you’ll be able to get the scroll.
pt_pt: Depois de conseguires isso, irás conseguir obter o pergaminho.

source: We hope this helps!
pt_pt: Espero ter ajudado!

source: Confirm your e-mail for an additional protection of the account and its easy accessibility from all your devices.
pt_pt: Confirma o teu e-mail para protegeres ainda mais a tua conta e acederes facilmente à mesma a partir de todos os teus dispositivos.

source: There is a legend about the blackest of Fridays, when a terror of multiple discounts falls upon Dominion... and this Halloween, the legend is coming true! Complete special quests and spend Coins in the event shop! The sale will only last four days, so don’t miss out on the chance to stock up! Valuable resources x4, Soul Stones for your Eternity Heroes, guild bundles, offers on chests, a new frame, and an avatar! Team up with the nightmare!
pt_pt: Há uma lenda sobre a mais negra das sextas-feiras, onde o terror de vários descontos se abate no Domínio. E este Halloween, a lenda irá cumprir-se! Conclui missões especiais e gasta moedas na loja do evento! A promoção apenas dura quatro dias, por isso, não percas a oportunidade de te abastecer! Recursos valiosos x4, pedras anímicas para a tua Eternidade, Heróis, conjuntos da guilda, ofertas em baús, uma nova moldura e um avatar! Junta-te ao pesadelo!

source: Dominion is in the grips of a rare scorcher! Oya gleams brilliantly in her new outfit, and the store shelves are melting under the hottest deals! The new event features a Solar Skin for Oya that can be upgraded even further! And don’t forget to pick up some Emeralds while they’re on sale at a x4 rate! You can also snag Summoning and Elemental Spheres at a 50% discount!
pt_pt: O calor tomou conta do Domínio! Oya resplandece no seu novo visual e as promoções estão a aquecer nas lojas! O novo evento dá-te um visual Solar para Oya, que podes melhorar ainda mais! Não te esqueças que também tens Esmeraldas a quadruplicar e 50% de desconto em Esferas Elementais e de Invocação!

source: Hello!
pt_pt: Olá!

source: We're sorry you experienced technical issues.
pt_pt: Lamentamos que estejas a ter problemas técnicos.

source: Please drop an email to our Support team with the details of the issue in the game.
pt_pt: Envia um email através do jogo com todos os pormenores para a nossa equipa de suporte.

source: Write to us via: bit.ly/HWSupport
pt_pt: Encontra-nos também em: bit.ly/HWSupport

source: The mighty clash of the Titans rings out across the whole Dominion! Complete event quests to earn Brawl Tokens and join the throw-down! Every victory will grant you Coins that can be exchanged at a special themed shop to treat yourself to useful resources and a special chest. Oh, and did we mention the new Super Titan skins? Don’t miss this chance!
pt_pt: O poderoso confronto de Titãs ecoa por todo o Domínio! Conclui missões do evento para ganhar Fichas de Brigas e junta-te à batalha! Cada vitória dar-te-á Moedas que podem ser trocadas numa loja especial temática onde podes conseguir recursos úteis e um baú especial. Ah, e nem mencionamos os novos visuais de Supertitã! Não percas esta oportunidade!

source: Free browser game.
pt_pt: Jogo de navegador gratuito.

source: Rule your kingdom and bring it to prosperity, destroy enemies and captur their wealth.
pt_pt: Governa o teu reino e leva-o à prosperidade, destrói inimigos e obtém as suas riquezas.

source: Stone by stone you will build up an inaccessible fortress and become a true leader for your invincible armies.
pt_pt: Pedra a pedra, construirás uma fortaleza impenetrável e tornar-te-ás um verdadeiro líder dos teus exércitos invencíveis.

source: Keep your base safely and further progress through the way to the Throne.
pt_pt: Protege a tua base e vence a luta pelo Trono.

source: Official website of Throne Rush.
pt_pt: Site oficial de Throne Rush.

source: Don't miss out on this month's prizes!
pt_pt: Não percas os prémios deste mês!

source: Click on each tube to rotate it.
pt_pt: Clica em cada tubo para os rodares.

source: Once you put them all in the correct position and have the lava flow to the central canal, you'll be done ;)
pt_pt: Encontra a posição correta dos tubos para que a lava flua para o canal central e assim torne possível concluir a missão ;)

source: Unknown e-mail
pt_pt: E-mail desconhecido

source: HEAL HIM!
pt_pt: CURA-O!

source: You need to create an account to make a purchase
pt_pt: Tens de criar uma conta para fazer uma compra

source: User social profile not found
pt_pt: Perfil social do utilizador não encontrado

source: A new Super Titan, Tenebris!
pt_pt: Uma nova Supertitã: Tenebris!

source: April Battle Pass!
pt_pt: Passe de Batalha de Abril!

source: Thank you for taking the time to write a review!
pt_pt: Obrigado pela tua avaliação!

source: In our ads we strive to capture the spirit of the game in a fun and catchy manner!
pt_pt: Com os nossos anúncios, pretendemos capturar o espírito do jogo de uma forma divertida e interessante!

source: As you progress further, you will discover lots of awesome features and hopefully have a great time playing!
pt_pt: À medida que avanças, vais descobrir muitos elementos incríveis e esperamos que te divirtas à grande!

source: ● 13 Campaign chapters and 190 Missions
pt_pt: ● 13 capítulos de campanha e 190 missões

source: COLLECT UNIQUE CHAMPIONS
pt_pt: COLECIONA CAMPEÕES ÚNICOS

source: Slay epic bosses!
pt_pt: Elimina bosses épicos!

source: Get the loot
pt_pt: Recolhe o saque

source: Lara Croft is our new hero!
pt_pt: Lara Croft é a nova heroína!

source: Hurry up for new spring outfits for Mushy & Shroom, Jet, and Sebastian, and win in style!
pt_pt: Obtém os novos visuais de primavera para Mushy e Shroom, Jet e Sebastian. Ganha em estilo!

source: Here’s your chance to freshen up Mojo, Qing Mao, and Faceless and try out the new skins in battles!
pt_pt: Vais poder dar um novo ar a Mojo, Qing Mao e Sem Rosto! Experimenta os novos visuais em combate!

source: We're sorry to hear that you've faced issues with the game :( We’d really appreciate it if you could contact our support team so that they could thoroughly investigate the problem.
pt_pt: Lamentamos saber que tiveste problemas com o jogo :( Agradecíamos imenso se pudesses contactar a nossa equipa de suporte para que possam investigar o problema.

source: Please use this link to do so: bit.ly/IQ_support Thank you!
pt_pt: Utiliza esta ligação, por favor: bit.ly/IQ_support Obrigado!

source: Freedom to Leprecats!
pt_pt: Liberdade para os gnomolinos!

source: The Dungeon
pt_pt: À Masmorra

source: While we are catching goblins</br> and troubleshooting, </br> here’s a couple of useful links:
pt_pt: Enquanto apanhamos os duendes</br> e resolvemos o problema, </br> deixamos-te alguns links úteis:

source: Build this cyber assassin's power all February!
pt_pt: Explora o poder da ciber-assassina em fevereiro!

source: Legends Draft in the Dominion!
pt_pt: Recruta Lendas no Domínio!

source: We're sorry to hear that you feel this way :( The developers work very hard to improve the game, taking into consideration all the feedback from the players.
pt_pt: Lamentamos que não tenhas uma opinião positiva :( Os criadores trabalham muito para melhorar o jogo e têm em consideração todos os comentários dos jogadores.

source: Hope that you’ll give Island Questaway one more chance!
pt_pt: Esperamos que dês mais uma oportunidade ao Island Questaway!

source: Instructions for changing your password will be sent to the e-mail address shown above
pt_pt: Serão enviadas instruções de alteração da palavra-passe para o endereço de e-mail mostrado acima

source: Thank you for your review!
pt_pt: Obrigado pela tua crítica!

source: We always carefully consider player feedback and take it into account when planning new updates.
pt_pt: Temos sempre em consideração os comentários dos jogadores e levamos isso em conta quando planeamos futuras atualizações.

source: Stay tuned!
pt_pt: Não percas as novidades!

source: We'll try our best to hit the mark with our future updates.
pt_pt: Vamos dar o nosso melhor para corresponder às expetativas nas próximas atualizações.

source: Battle, explore and level up to take on even the toughest opponents!
pt_pt: Luta, explora e sobe de nível para enfrentar até os adversários!

source: The Reign of Chaos has begun!
pt_pt: O Reino do Caos começou!

source: We're inviting all the heroes of the Dominion to join us and have some fun!
pt_pt: Convidamos todos os heróis do Domínio a juntar-se ao mais divertido dos eventos!

source: Cracking Up The April Fool's Day sale is about to go live!
pt_pt: Loucura A promoção do Dia das Mentiras está quase a chegar!

source: Buy colorful new skins for three heroes and all kinds of useful wares at ridiculously low prices!
pt_pt: Compra visuais coloridos para três heróis e todo o tipo de artigos úteis a preços absurdamente baixos!

source: It's time for a carefree party!
pt_pt: Está na hora de uma festa bem louca!

source: New Super Prize
pt_pt: Novo superprémio

source: Level up the tree and rank up your guild for three days.
pt_pt: Sobe a árvore de nível e sobe na classificação com a tua guilda por três dias.

source: Make sure to check out the event shop while you're at it!
pt_pt: Aproveita e espreita a loja do evento!

source: The application has been updated.
pt_pt: A aplicação foi atualizada.

source: Please refresh the page
pt_pt: Atualiza a página.

source: The Hero's Way
pt_pt: O Caminho do Herói

source: Win the most valuable rewards for the June Battle Pass!
pt_pt: Ganha as recompensas mais valiosas para o Passe de Batalha de Junho!

source: The grand prizes are Soul Stones and Artifact Fragments for Tenebris, as well as a Celestial Skin for Aidan!
pt_pt: Os grandes prémios são Pedras Anímicas e Fragmentos de Artefactos para Tenebris, assim como um Visual Celestial para Aidan!

source: On top of all that, you’ll immediately unlock a seasonal frame for purchasing the premium version, earning a bright new avatar later!
pt_pt: Além disso, desbloquearás imediatamente uma moldura sazonal por comprares a versão premium e posteriormente, um novo avatar!

source: Dive into the summer vibe!
pt_pt: Mergulha na onda do verão!

source: Throne Rush could send you notifications with free energy, gifts and news
pt_pt: Throne Rush pode enviar-te notificações sobre energia gratuita, presentes e notícias

source: Romanian Leu
pt_pt: Leu romeno

source: Hone the scholarly Guardian's skills this March!
pt_pt: Em março, melhora as habilidades deste Guardião!

source: I'M GONNA BE A DAD!
pt_pt: VOU SER PAI!

source: Keros has arrived and is ready to establish new rules in the world of Titans.
pt_pt: Keros chegou pronto a criar novas regras para o mundo dos Titãs.

source: Get him on your team if you dare!
pt_pt: Junta-o à tua equipa, se tiveres coragem!

source: You're gonna be DAD soon!
pt_pt: Estás quase a ser PAPÁ!

source: Born of Darkness itself, Brustar joins the ranks of the Titans!
pt_pt: Nascido da própria Escuridão, Brustar junta-se aos Titãs!

source: Recruit him and unleash his might in the new event!
pt_pt: Recruta-o e liberta o seu poder no novo evento!

source: Instructions for changing your password have been sent to the e-mail!
pt_pt: Foram enviadas instruções de alteração da palavra-passe por e-mail!

source: Сheck your Inbox or Spam folder.
pt_pt: Verifica a tua Caixa de Entrada ou a pasta de Spam.

source: Terms of service of the Throne Rush web platform
pt_pt: Termos de Serviço da plataforma da Web do Throne Rush

source: Don't miss out on the hottest Skins of the season!
pt_pt: Não percas os visuais mais estilosos da estação!

source: Receive polls and other newsletters from NextersGlobal
pt_pt: Recebe sondagens e outras newsletters da NextersGlobal

source: The email has been sent!
pt_pt: E-mail enviado!

source: If you do not see the email select Resend button.
pt_pt: Se não encontrares o e-mail, clica no botão Reenviar.

source: Tropical Fair!
pt_pt: Feira Tropical!

source: In our ads, we strive to capture the spirit of the game in a fun and catchy manner!
pt_pt: Com os nossos anúncios, pretendemos capturar o espírito do jogo de uma forma divertida e interessante!
